[
    {
        "platform": "web",
        "type": "Frontend",
        "name": "My SWE Portfolio",
        "title": "Portfolio",
        "technologies": [
            "Typescript ",
            "Gatsby",
            "React",
            "TailwindCss",
            "Css",
            "Json"
        ],
        "description": "My portfolio website showcasing my skills, progress and career as a software engineer.",
        "caseStudy": "Its always a good idea to have a portfolio to showcase your work and projects to friends, future employers, other prospects and especially to yourself as a good reminder of the humble beginnings as you look back. The portfolio uses a static site generator (gatsby) and uses the (typescript) version for the benefit and correctness of typed languages.The design was inspired by material and the use of rounded and casual icons to fit the them, along with a clean yet vibrant and simple fusion was a successful blend and quite enticing.",
        "experience": "After a long time tying to shy away from React and being unsure of what to think about it. i finally jumped into it to check it out. Friends would cheer and recommend to try it out but as a backend lover i didn't think of venturing into it. until the thought of jobs requiring it as a part of fullstack developers and engineers, and it along with angular being the pioneers of old, it then was a matter of time to chose between the two. i then read a book from syncfusion.com called, 'React Succinctly' and from there it was a fun ride.Then gatsby was out of curiosity about static site generators along with the adoption of typescript and trying it out live on a working project so i can truly appreciate and see its pros and cons.",
        "bannerUrl": "https://github.com/Stroustrups-Sentinel/readme/blob/main/src/images/projects/portfolio/banner.png?raw=true",
        "logoUrl": "",
        "openUrl": "#",
        "moreUrl": "projects/portfolio",
        "altText": "",
        "imageUrls": [
            "https://github.com/Stroustrups-Sentinel/readme/blob/main/src/images/projects/portfolio/image1.png?raw=true",
            "https://github.com/Stroustrups-Sentinel/readme/blob/main/src/images/projects/portfolio/image2.png?raw=true",
            "https://github.com/Stroustrups-Sentinel/readme/blob/main/src/images/projects/portfolio/image3.png?raw=true",
            "https://github.com/Stroustrups-Sentinel/readme/blob/main/src/images/projects/portfolio/image4.png?raw=true"
        ],
        "repositoryUrl":"https://github.com/Stroustrups-Sentinel/readme"
    }
]